// 다차원 배열과 포인터 배열
// 2차원 배열 초기화
#include<stdio.h>

int main(void) {
	int num1[3][4] = { {1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12} };
	int num2[3][4] = { {1}, {5, 6}, {9, 10, 11} };
	int num3[ ][4] = { {1}, {2, 3}, {4, 5, 6} };
	int num4[3][4] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 };
	int num5[3][4] = { 1, 2, 3, 4, 5, 6 };
	int num6[ ][4] = { 1, 2, 3, 4, 5, 6 };
	int i, j;

	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++) {
			printf("%5d", num6[i][j]);
		}
		printf("\n");
	}

	return 0;
}